"Entity/Category" = "Category";
"Entity/Document" = "Document";

"Property/error" = "error";
"Property/errorIsUnrecoverable" = "error-is-unrecoverable flag";
"Property/hidden" = "private flag";
"Property/name" = "name";
"Property/path" = "file path";
"Property/position" = "position";
"Property/progress" = "upload progress";
"Property/scribdID" = "Scribd.com ID";
"Property/success" = "upload-successful flag";
"Property/summary" = "description";
"Property/tags" = "tags";
"Property/title" = "title";

"Relationship/category" = "category";
"Relationship/children" = "children";
"Relationship/documents" = "documents";
"Relationship/parent" = "parent";
